Revit 2027 API
BuiltInFailures.StairRampFailures.MultusegmentRampRiserError Property
 Ramp can't have multisegment Riser.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MultusegmentRampRiserError { get; }
Public Shared ReadOnly Property MultusegmentRampRiserError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MultusegmentRampRiserError {
	FailureDefinitionId^ get ();
}
static member MultusegmentRampRiserError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace